// Написать функцию, которая принимает массив чисел и число, а возвращает количество подмассивов, сумма которых равна заданному числу.
#include <vector>
#include <iostream>

int Function(const std::vector<int> &nums) {
    int n = nums.size();
    int ans = 0;
    return ans;
}

int main() {
    std::vector<int> vec = {2, 7, 7, -3, 0, 7};
    std::cout << Function(vec);
    return 0;
}
